grevaillot/svd_tools/headers/ATSAMR34J16B/sercom0.h
#pragma once 

/* --- SERCOM0: Serial Communication Interface 0 -------------------- */

/** @defgroup sercom0_registers Serial Communication Interface 0 Register
@{*/

/** SERCOM0_I2CM_CTRLA I2CM Control A **/
#define SERCOM0_I2CM_CTRLA			MMIO32(SERCOM0_BASE + 0x00)
/** SERCOM0_I2CS_CTRLA I2CS Control A **/
#define SERCOM0_I2CS_CTRLA			MMIO32(SERCOM0_BASE + 0x00)
/** SERCOM0_SPI_CTRLA SPI Control A **/
#define SERCOM0_SPI_CTRLA			MMIO32(SERCOM0_BASE + 0x00)
/** SERCOM0_USART_CTRLA USART Control A **/
#define SERCOM0_USART_CTRLA			MMIO32(SERCOM0_BASE + 0x00)
/** SERCOM0_I2CM_CTRLB I2CM Control B **/
#define SERCOM0_I2CM_CTRLB			MMIO32(SERCOM0_BASE + 0x04)
/** SERCOM0_I2CS_CTRLB I2CS Control B **/
#define SERCOM0_I2CS_CTRLB			MMIO32(SERCOM0_BASE + 0x04)
/** SERCOM0_SPI_CTRLB SPI Control B **/
#define SERCOM0_SPI_CTRLB			MMIO32(SERCOM0_BASE + 0x04)
/** SERCOM0_USART_CTRLB USART Control B **/
#define SERCOM0_USART_CTRLB			MMIO32(SERCOM0_BASE + 0x04)
/** SERCOM0_I2CM_BAUD I2CM Baud Rate **/
#define SERCOM0_I2CM_BAUD			MMIO32(SERCOM0_BASE + 0x0c)
/** SERCOM0_SPI_BAUD SPI Baud Rate **/
#define SERCOM0_SPI_BAUD			MMIO32(SERCOM0_BASE + 0x0c)
/** SERCOM0_USART_BAUD USART Baud Rate **/
#define SERCOM0_USART_BAUD			MMIO32(SERCOM0_BASE + 0x0c)
/** SERCOM0_USART_BAUD_FRAC_MODE USART Baud Rate **/
#define SERCOM0_USART_BAUD_FRAC_MODE			MMIO32(SERCOM0_BASE + 0x0c)
/** SERCOM0_USART_BAUD_FRACFP_MODE USART Baud Rate **/
#define SERCOM0_USART_BAUD_FRACFP_MODE			MMIO32(SERCOM0_BASE + 0x0c)
/** SERCOM0_USART_BAUD_USARTFP_MODE USART Baud Rate **/
#define SERCOM0_USART_BAUD_USARTFP_MODE			MMIO32(SERCOM0_BASE + 0x0c)
/** SERCOM0_USART_RXPL USART Receive Pulse Length **/
#define SERCOM0_USART_RXPL			MMIO32(SERCOM0_BASE + 0x0e)
/** SERCOM0_I2CM_INTENCLR I2CM Interrupt Enable Clear **/
#define SERCOM0_I2CM_INTENCLR			MMIO32(SERCOM0_BASE + 0x14)
/** SERCOM0_I2CS_INTENCLR I2CS Interrupt Enable Clear **/
#define SERCOM0_I2CS_INTENCLR			MMIO32(SERCOM0_BASE + 0x14)
/** SERCOM0_SPI_INTENCLR SPI Interrupt Enable Clear **/
#define SERCOM0_SPI_INTENCLR			MMIO32(SERCOM0_BASE + 0x14)
/** SERCOM0_USART_INTENCLR USART Interrupt Enable Clear **/
#define SERCOM0_USART_INTENCLR			MMIO32(SERCOM0_BASE + 0x14)
/** SERCOM0_I2CM_INTENSET I2CM Interrupt Enable Set **/
#define SERCOM0_I2CM_INTENSET			MMIO32(SERCOM0_BASE + 0x16)
/** SERCOM0_I2CS_INTENSET I2CS Interrupt Enable Set **/
#define SERCOM0_I2CS_INTENSET			MMIO32(SERCOM0_BASE + 0x16)
/** SERCOM0_SPI_INTENSET SPI Interrupt Enable Set **/
#define SERCOM0_SPI_INTENSET			MMIO32(SERCOM0_BASE + 0x16)
/** SERCOM0_USART_INTENSET USART Interrupt Enable Set **/
#define SERCOM0_USART_INTENSET			MMIO32(SERCOM0_BASE + 0x16)
/** SERCOM0_I2CM_INTFLAG I2CM Interrupt Flag Status and Clear **/
#define SERCOM0_I2CM_INTFLAG			MMIO32(SERCOM0_BASE + 0x18)
/** SERCOM0_I2CS_INTFLAG I2CS Interrupt Flag Status and Clear **/
#define SERCOM0_I2CS_INTFLAG			MMIO32(SERCOM0_BASE + 0x18)
/** SERCOM0_SPI_INTFLAG SPI Interrupt Flag Status and Clear **/
#define SERCOM0_SPI_INTFLAG			MMIO32(SERCOM0_BASE + 0x18)
/** SERCOM0_USART_INTFLAG USART Interrupt Flag Status and Clear **/
#define SERCOM0_USART_INTFLAG			MMIO32(SERCOM0_BASE + 0x18)
/** SERCOM0_I2CM_STATUS I2CM Status **/
#define SERCOM0_I2CM_STATUS			MMIO32(SERCOM0_BASE + 0x1a)
/** SERCOM0_I2CS_STATUS I2CS Status **/
#define SERCOM0_I2CS_STATUS			MMIO32(SERCOM0_BASE + 0x1a)
/** SERCOM0_SPI_STATUS SPI Status **/
#define SERCOM0_SPI_STATUS			MMIO32(SERCOM0_BASE + 0x1a)
/** SERCOM0_USART_STATUS USART Status **/
#define SERCOM0_USART_STATUS			MMIO32(SERCOM0_BASE + 0x1a)
/** SERCOM0_I2CM_SYNCBUSY I2CM Synchronization Busy **/
#define SERCOM0_I2CM_SYNCBUSY			MMIO32(SERCOM0_BASE + 0x1c)
/** SERCOM0_I2CS_SYNCBUSY I2CS Synchronization Busy **/
#define SERCOM0_I2CS_SYNCBUSY			MMIO32(SERCOM0_BASE + 0x1c)
/** SERCOM0_SPI_SYNCBUSY SPI Synchronization Busy **/
#define SERCOM0_SPI_SYNCBUSY			MMIO32(SERCOM0_BASE + 0x1c)
/** SERCOM0_USART_SYNCBUSY USART Synchronization Busy **/
#define SERCOM0_USART_SYNCBUSY			MMIO32(SERCOM0_BASE + 0x1c)
/** SERCOM0_I2CM_ADDR I2CM Address **/
#define SERCOM0_I2CM_ADDR			MMIO32(SERCOM0_BASE + 0x24)
/** SERCOM0_I2CS_ADDR I2CS Address **/
#define SERCOM0_I2CS_ADDR			MMIO32(SERCOM0_BASE + 0x24)
/** SERCOM0_SPI_ADDR SPI Address **/
#define SERCOM0_SPI_ADDR			MMIO32(SERCOM0_BASE + 0x24)
/** SERCOM0_I2CM_DATA I2CM Data **/
#define SERCOM0_I2CM_DATA			MMIO32(SERCOM0_BASE + 0x28)
/** SERCOM0_I2CS_DATA I2CS Data **/
#define SERCOM0_I2CS_DATA			MMIO32(SERCOM0_BASE + 0x28)
/** SERCOM0_SPI_DATA SPI Data **/
#define SERCOM0_SPI_DATA			MMIO32(SERCOM0_BASE + 0x28)
/** SERCOM0_USART_DATA USART Data **/
#define SERCOM0_USART_DATA			MMIO32(SERCOM0_BASE + 0x28)
/** SERCOM0_I2CM_DBGCTRL I2CM Debug Control **/
#define SERCOM0_I2CM_DBGCTRL			MMIO32(SERCOM0_BASE + 0x30)
/** SERCOM0_SPI_DBGCTRL SPI Debug Control **/
#define SERCOM0_SPI_DBGCTRL			MMIO32(SERCOM0_BASE + 0x30)
/** SERCOM0_USART_DBGCTRL USART Debug Control **/
#define SERCOM0_USART_DBGCTRL			MMIO32(SERCOM0_BASE + 0x30)

/**@}*/


/** @defgroup sercom0_i2cm_ctrla I2CMCTRLA I2CM Control A
@{*/

/** SERCOM0_I2CM_CTRLA_LOWTOUTEN SCL Low Timeout Enable **/
#define SERCOM0_I2CM_CTRLA_LOWTOUTEN		(1 << 30)

#define SERCOM0_I2CM_CTRLA_INACTOUT_SHIFT		28
#define SERCOM0_I2CM_CTRLA_INACTOUT_MASK		0x03
/** @defgroup sercom0_i2cm_ctrla_inactout INACTOUT Inactive Time-Out
@{*/
/**@}*/

/** SERCOM0_I2CM_CTRLA_SCLSM SCL Clock Stretch Mode **/
#define SERCOM0_I2CM_CTRLA_SCLSM		(1 << 27)

#define SERCOM0_I2CM_CTRLA_SPEED_SHIFT		24
#define SERCOM0_I2CM_CTRLA_SPEED_MASK		0x03
/** @defgroup sercom0_i2cm_ctrla_speed SPEED Transfer Speed
@{*/
/**@}*/

/** SERCOM0_I2CM_CTRLA_SEXTTOEN Slave SCL Low Extend Timeout **/
#define SERCOM0_I2CM_CTRLA_SEXTTOEN		(1 << 23)
/** SERCOM0_I2CM_CTRLA_MEXTTOEN Master SCL Low Extend Timeout **/
#define SERCOM0_I2CM_CTRLA_MEXTTOEN		(1 << 22)

#define SERCOM0_I2CM_CTRLA_SDAHOLD_SHIFT		20
#define SERCOM0_I2CM_CTRLA_SDAHOLD_MASK		0x03
/** @defgroup sercom0_i2cm_ctrla_sdahold SDAHOLD SDA Hold Time
@{*/
/**@}*/

