grevaillot/svd_tools/headers/ATSAMR34J16B/sercom0.h
/** SERCOM0_I2CM_CTRLA_PINOUT Pin Usage **/
#define SERCOM0_I2CM_CTRLA_PINOUT		(1 << 16)
/** SERCOM0_I2CM_CTRLA_RUNSTDBY Run in Standby **/
#define SERCOM0_I2CM_CTRLA_RUNSTDBY		(1 << 7)

#define SERCOM0_I2CM_CTRLA_MODE_SHIFT		2
#define SERCOM0_I2CM_CTRLA_MODE_MASK		0x07
/** @defgroup sercom0_i2cm_ctrla_mode MODE Operating Mode
@{*/
/**@}*/

/** SERCOM0_I2CM_CTRLA_ENABLE Enable **/
#define SERCOM0_I2CM_CTRLA_ENABLE		(1 << 1)
/** SERCOM0_I2CM_CTRLA_SWRST Software Reset **/
#define SERCOM0_I2CM_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cs_ctrla I2CSCTRLA I2CS Control A
@{*/

/** SERCOM0_I2CS_CTRLA_LOWTOUTEN SCL Low Timeout Enable **/
#define SERCOM0_I2CS_CTRLA_LOWTOUTEN		(1 << 30)
/** SERCOM0_I2CS_CTRLA_SCLSM SCL Clock Stretch Mode **/
#define SERCOM0_I2CS_CTRLA_SCLSM		(1 << 27)

#define SERCOM0_I2CS_CTRLA_SPEED_SHIFT		24
#define SERCOM0_I2CS_CTRLA_SPEED_MASK		0x03
/** @defgroup sercom0_i2cs_ctrla_speed SPEED Transfer Speed
@{*/
/**@}*/

/** SERCOM0_I2CS_CTRLA_SEXTTOEN Slave SCL Low Extend Timeout **/
#define SERCOM0_I2CS_CTRLA_SEXTTOEN		(1 << 23)

#define SERCOM0_I2CS_CTRLA_SDAHOLD_SHIFT		20
#define SERCOM0_I2CS_CTRLA_SDAHOLD_MASK		0x03
/** @defgroup sercom0_i2cs_ctrla_sdahold SDAHOLD SDA Hold Time
@{*/
/**@}*/

/** SERCOM0_I2CS_CTRLA_PINOUT Pin Usage **/
#define SERCOM0_I2CS_CTRLA_PINOUT		(1 << 16)
/** SERCOM0_I2CS_CTRLA_RUNSTDBY Run during Standby **/
#define SERCOM0_I2CS_CTRLA_RUNSTDBY		(1 << 7)

#define SERCOM0_I2CS_CTRLA_MODE_SHIFT		2
#define SERCOM0_I2CS_CTRLA_MODE_MASK		0x07
/** @defgroup sercom0_i2cs_ctrla_mode MODE Operating Mode
@{*/
/**@}*/

/** SERCOM0_I2CS_CTRLA_ENABLE Enable **/
#define SERCOM0_I2CS_CTRLA_ENABLE		(1 << 1)
/** SERCOM0_I2CS_CTRLA_SWRST Software Reset **/
#define SERCOM0_I2CS_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup sercom0_spi_ctrla SPICTRLA SPI Control A
@{*/

/** SERCOM0_SPI_CTRLA_DORD Data Order **/
#define SERCOM0_SPI_CTRLA_DORD		(1 << 30)
/** SERCOM0_SPI_CTRLA_CPOL Clock Polarity **/
#define SERCOM0_SPI_CTRLA_CPOL		(1 << 29)
/** SERCOM0_SPI_CTRLA_CPHA Clock Phase **/
#define SERCOM0_SPI_CTRLA_CPHA		(1 << 28)

#define SERCOM0_SPI_CTRLA_FORM_SHIFT		24
#define SERCOM0_SPI_CTRLA_FORM_MASK		0x0f
/** @defgroup sercom0_spi_ctrla_form FORM Frame Format
@{*/
/**@}*/


#define SERCOM0_SPI_CTRLA_DIPO_SHIFT		20
#define SERCOM0_SPI_CTRLA_DIPO_MASK		0x03
/** @defgroup sercom0_spi_ctrla_dipo DIPO Data In Pinout
@{*/
/**@}*/


#define SERCOM0_SPI_CTRLA_DOPO_SHIFT		16
#define SERCOM0_SPI_CTRLA_DOPO_MASK		0x03
/** @defgroup sercom0_spi_ctrla_dopo DOPO Data Out Pinout
@{*/
/**@}*/

/** SERCOM0_SPI_CTRLA_IBON Immediate Buffer Overflow Notification **/
#define SERCOM0_SPI_CTRLA_IBON		(1 << 8)
/** SERCOM0_SPI_CTRLA_RUNSTDBY Run during Standby **/
#define SERCOM0_SPI_CTRLA_RUNSTDBY		(1 << 7)

#define SERCOM0_SPI_CTRLA_MODE_SHIFT		2
#define SERCOM0_SPI_CTRLA_MODE_MASK		0x07
/** @defgroup sercom0_spi_ctrla_mode MODE Operating Mode
@{*/
/**@}*/

/** SERCOM0_SPI_CTRLA_ENABLE Enable **/
#define SERCOM0_SPI_CTRLA_ENABLE		(1 << 1)
/** SERCOM0_SPI_CTRLA_SWRST Software Reset **/
#define SERCOM0_SPI_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup sercom0_usart_ctrla USARTCTRLA USART Control A
@{*/

/** SERCOM0_USART_CTRLA_DORD Data Order **/
#define SERCOM0_USART_CTRLA_DORD		(1 << 30)
/** SERCOM0_USART_CTRLA_CPOL Clock Polarity **/
#define SERCOM0_USART_CTRLA_CPOL		(1 << 29)
/** SERCOM0_USART_CTRLA_CMODE Communication Mode **/
#define SERCOM0_USART_CTRLA_CMODE		(1 << 28)

#define SERCOM0_USART_CTRLA_FORM_SHIFT		24
#define SERCOM0_USART_CTRLA_FORM_MASK		0x0f
/** @defgroup sercom0_usart_ctrla_form FORM Frame Format
@{*/
/**@}*/


#define SERCOM0_USART_CTRLA_SAMPA_SHIFT		22
#define SERCOM0_USART_CTRLA_SAMPA_MASK		0x03
/** @defgroup sercom0_usart_ctrla_sampa SAMPA Sample Adjustment
@{*/
/**@}*/


#define SERCOM0_USART_CTRLA_RXPO_SHIFT		20
#define SERCOM0_USART_CTRLA_RXPO_MASK		0x03
/** @defgroup sercom0_usart_ctrla_rxpo RXPO Receive Data Pinout
@{*/
/**@}*/


#define SERCOM0_USART_CTRLA_TXPO_SHIFT		16
#define SERCOM0_USART_CTRLA_TXPO_MASK		0x03
/** @defgroup sercom0_usart_ctrla_txpo TXPO Transmit Data Pinout
@{*/
/**@}*/


#define SERCOM0_USART_CTRLA_SAMPR_SHIFT		13
#define SERCOM0_USART_CTRLA_SAMPR_MASK		0x07
/** @defgroup sercom0_usart_ctrla_sampr SAMPR Sample
@{*/
/**@}*/

/** SERCOM0_USART_CTRLA_IBON Immediate Buffer Overflow Notification **/
#define SERCOM0_USART_CTRLA_IBON		(1 << 8)
/** SERCOM0_USART_CTRLA_RUNSTDBY Run during Standby **/
#define SERCOM0_USART_CTRLA_RUNSTDBY		(1 << 7)

#define SERCOM0_USART_CTRLA_MODE_SHIFT		2
#define SERCOM0_USART_CTRLA_MODE_MASK		0x07
/** @defgroup sercom0_usart_ctrla_mode MODE Operating Mode
@{*/
/**@}*/

/** SERCOM0_USART_CTRLA_ENABLE Enable **/
#define SERCOM0_USART_CTRLA_ENABLE		(1 << 1)
/** SERCOM0_USART_CTRLA_SWRST Software Reset **/
#define SERCOM0_USART_CTRLA_SWRST		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cm_ctrlb I2CMCTRLB I2CM Control B
@{*/

/** SERCOM0_I2CM_CTRLB_ACKACT Acknowledge Action **/
#define SERCOM0_I2CM_CTRLB_ACKACT		(1 << 18)

#define SERCOM0_I2CM_CTRLB_CMD_SHIFT		16
#define SERCOM0_I2CM_CTRLB_CMD_MASK		0x03
/** @defgroup sercom0_i2cm_ctrlb_cmd CMD Command
@{*/
/**@}*/

/** SERCOM0_I2CM_CTRLB_QCEN Quick Command Enable **/
#define SERCOM0_I2CM_CTRLB_QCEN		(1 << 9)
/** SERCOM0_I2CM_CTRLB_SMEN Smart Mode Enable **/
#define SERCOM0_I2CM_CTRLB_SMEN		(1 << 8)

/**@}*/

/** @defgroup sercom0_i2cs_ctrlb I2CSCTRLB I2CS Control B
@{*/

/** SERCOM0_I2CS_CTRLB_ACKACT Acknowledge Action **/
#define SERCOM0_I2CS_CTRLB_ACKACT		(1 << 18)

#define SERCOM0_I2CS_CTRLB_CMD_SHIFT		16
#define SERCOM0_I2CS_CTRLB_CMD_MASK		0x03
/** @defgroup sercom0_i2cs_ctrlb_cmd CMD Command
@{*/
/**@}*/


#define SERCOM0_I2CS_CTRLB_AMODE_SHIFT		14
#define SERCOM0_I2CS_CTRLB_AMODE_MASK		0x03
/** @defgroup sercom0_i2cs_ctrlb_amode AMODE Address Mode
@{*/
/**@}*/

/** SERCOM0_I2CS_CTRLB_AACKEN Automatic Address Acknowledge **/
#define SERCOM0_I2CS_CTRLB_AACKEN		(1 << 10)
/** SERCOM0_I2CS_CTRLB_GCMD PMBus Group Command **/
#define SERCOM0_I2CS_CTRLB_GCMD		(1 << 9)
/** SERCOM0_I2CS_CTRLB_SMEN Smart Mode Enable **/
#define SERCOM0_I2CS_CTRLB_SMEN		(1 << 8)

/**@}*/

/** @defgroup sercom0_spi_ctrlb SPICTRLB SPI Control B
@{*/

/** SERCOM0_SPI_CTRLB_RXEN Receiver Enable **/
#define SERCOM0_SPI_CTRLB_RXEN		(1 << 17)

#define SERCOM0_SPI_CTRLB_AMODE_SHIFT		14
#define SERCOM0_SPI_CTRLB_AMODE_MASK		0x03
/** @defgroup sercom0_spi_ctrlb_amode AMODE Address Mode
@{*/
/**@}*/

/** SERCOM0_SPI_CTRLB_MSSEN Master Slave Select Enable **/
#define SERCOM0_SPI_CTRLB_MSSEN		(1 << 13)
/** SERCOM0_SPI_CTRLB_SSDE Slave Select Low Detect Enable **/
#define SERCOM0_SPI_CTRLB_SSDE		(1 << 9)
/** SERCOM0_SPI_CTRLB_PLOADEN Data Preload Enable **/
#define SERCOM0_SPI_CTRLB_PLOADEN		(1 << 6)

#define SERCOM0_SPI_CTRLB_CHSIZE_SHIFT		0
#define SERCOM0_SPI_CTRLB_CHSIZE_MASK		0x07
/** @defgroup sercom0_spi_ctrlb_chsize CHSIZE Character Size
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_usart_ctrlb USARTCTRLB USART Control B
@{*/

/** SERCOM0_USART_CTRLB_RXEN Receiver Enable **/
#define SERCOM0_USART_CTRLB_RXEN		(1 << 17)
/** SERCOM0_USART_CTRLB_TXEN Transmitter Enable **/
#define SERCOM0_USART_CTRLB_TXEN		(1 << 16)
/** SERCOM0_USART_CTRLB_PMODE Parity Mode **/
#define SERCOM0_USART_CTRLB_PMODE		(1 << 13)
/** SERCOM0_USART_CTRLB_ENC Encoding Format **/
#define SERCOM0_USART_CTRLB_ENC		(1 << 10)
/** SERCOM0_USART_CTRLB_SFDE Start of Frame Detection Enable **/
#define SERCOM0_USART_CTRLB_SFDE		(1 << 9)
/** SERCOM0_USART_CTRLB_COLDEN Collision Detection Enable **/
#define SERCOM0_USART_CTRLB_COLDEN		(1 << 8)
/** SERCOM0_USART_CTRLB_SBMODE Stop Bit Mode **/
#define SERCOM0_USART_CTRLB_SBMODE		(1 << 6)

#define SERCOM0_USART_CTRLB_CHSIZE_SHIFT		0
#define SERCOM0_USART_CTRLB_CHSIZE_MASK		0x07
/** @defgroup sercom0_usart_ctrlb_chsize CHSIZE Character Size
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_i2cm_baud I2CMBAUD I2CM Baud Rate
@{*/


#define SERCOM0_I2CM_BAUD_HSBAUDLOW_SHIFT		24
#define SERCOM0_I2CM_BAUD_HSBAUDLOW_MASK		0xff
/** @defgroup sercom0_i2cm_baud_hsbaudlow HSBAUDLOW High Speed Baud Rate Value Low
@{*/
/**@}*/


#define SERCOM0_I2CM_BAUD_HSBAUD_SHIFT		16
#define SERCOM0_I2CM_BAUD_HSBAUD_MASK		0xff
/** @defgroup sercom0_i2cm_baud_hsbaud HSBAUD High Speed Baud Rate Value
@{*/
/**@}*/


#define SERCOM0_I2CM_BAUD_BAUDLOW_SHIFT		8
#define SERCOM0_I2CM_BAUD_BAUDLOW_MASK		0xff
/** @defgroup sercom0_i2cm_baud_baudlow BAUDLOW Baud Rate Value Low
@{*/
/**@}*/


#define SERCOM0_I2CM_BAUD_BAUD_SHIFT		0
#define SERCOM0_I2CM_BAUD_BAUD_MASK		0xff
/** @defgroup sercom0_i2cm_baud_baud BAUD Baud Rate Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_spi_baud SPIBAUD SPI Baud Rate
@{*/


#define SERCOM0_SPI_BAUD_BAUD_SHIFT		0
#define SERCOM0_SPI_BAUD_BAUD_MASK		0xff
/** @defgroup sercom0_spi_baud_baud BAUD Baud Rate Value
@{*/
/**@}*/


/**@}*/

