grevaillot/svd_tools/headers/ATSAMR34J16B/sercom0.h
/** @defgroup sercom0_usart_baud USARTBAUD USART Baud Rate
@{*/


#define SERCOM0_USART_BAUD_BAUD_SHIFT		0
#define SERCOM0_USART_BAUD_BAUD_MASK		0xffff
/** @defgroup sercom0_usart_baud_baud BAUD Baud Rate Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_usart_baud_frac_mode USARTBAUDFRACMODE USART Baud Rate
@{*/


#define SERCOM0_USART_BAUD_FRAC_MODE_FP_SHIFT		13
#define SERCOM0_USART_BAUD_FRAC_MODE_FP_MASK		0x07
/** @defgroup sercom0_usart_baud_frac_mode_fp FP Fractional Part
@{*/
/**@}*/


#define SERCOM0_USART_BAUD_FRAC_MODE_BAUD_SHIFT		0
#define SERCOM0_USART_BAUD_FRAC_MODE_BAUD_MASK		0x1fff
/** @defgroup sercom0_usart_baud_frac_mode_baud BAUD Baud Rate Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_usart_baud_fracfp_mode USARTBAUDFRACFPMODE USART Baud Rate
@{*/


#define SERCOM0_USART_BAUD_FRACFP_MODE_FP_SHIFT		13
#define SERCOM0_USART_BAUD_FRACFP_MODE_FP_MASK		0x07
/** @defgroup sercom0_usart_baud_fracfp_mode_fp FP Fractional Part
@{*/
/**@}*/


#define SERCOM0_USART_BAUD_FRACFP_MODE_BAUD_SHIFT		0
#define SERCOM0_USART_BAUD_FRACFP_MODE_BAUD_MASK		0x1fff
/** @defgroup sercom0_usart_baud_fracfp_mode_baud BAUD Baud Rate Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_usart_baud_usartfp_mode USARTBAUDUSARTFPMODE USART Baud Rate
@{*/


#define SERCOM0_USART_BAUD_USARTFP_MODE_BAUD_SHIFT		0
#define SERCOM0_USART_BAUD_USARTFP_MODE_BAUD_MASK		0xffff
/** @defgroup sercom0_usart_baud_usartfp_mode_baud BAUD Baud Rate Value
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_usart_rxpl USARTRXPL USART Receive Pulse Length
@{*/


#define SERCOM0_USART_RXPL_RXPL_SHIFT		0
#define SERCOM0_USART_RXPL_RXPL_MASK		0xff
/** @defgroup sercom0_usart_rxpl_rxpl RXPL Receive Pulse Length
@{*/
/**@}*/


/**@}*/

/** @defgroup sercom0_i2cm_intenclr I2CMINTENCLR I2CM Interrupt Enable Clear
@{*/

/** SERCOM0_I2CM_INTENCLR_ERROR Combined Error Interrupt Disable **/
#define SERCOM0_I2CM_INTENCLR_ERROR		(1 << 7)
/** SERCOM0_I2CM_INTENCLR_SB Slave On Bus Interrupt Disable **/
#define SERCOM0_I2CM_INTENCLR_SB		(1 << 1)
/** SERCOM0_I2CM_INTENCLR_MB Master On Bus Interrupt Disable **/
#define SERCOM0_I2CM_INTENCLR_MB		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cs_intenclr I2CSINTENCLR I2CS Interrupt Enable Clear
@{*/

/** SERCOM0_I2CS_INTENCLR_ERROR Combined Error Interrupt Disable **/
#define SERCOM0_I2CS_INTENCLR_ERROR		(1 << 7)
/** SERCOM0_I2CS_INTENCLR_DRDY Data Interrupt Disable **/
#define SERCOM0_I2CS_INTENCLR_DRDY		(1 << 2)
/** SERCOM0_I2CS_INTENCLR_AMATCH Address Match Interrupt Disable **/
#define SERCOM0_I2CS_INTENCLR_AMATCH		(1 << 1)
/** SERCOM0_I2CS_INTENCLR_PREC Stop Received Interrupt Disable **/
#define SERCOM0_I2CS_INTENCLR_PREC		(1 << 0)

/**@}*/

/** @defgroup sercom0_spi_intenclr SPIINTENCLR SPI Interrupt Enable Clear
@{*/

/** SERCOM0_SPI_INTENCLR_ERROR Combined Error Interrupt Disable **/
#define SERCOM0_SPI_INTENCLR_ERROR		(1 << 7)
/** SERCOM0_SPI_INTENCLR_SSL Slave Select Low Interrupt Disable **/
#define SERCOM0_SPI_INTENCLR_SSL		(1 << 3)
/** SERCOM0_SPI_INTENCLR_RXC Receive Complete Interrupt Disable **/
#define SERCOM0_SPI_INTENCLR_RXC		(1 << 2)
/** SERCOM0_SPI_INTENCLR_TXC Transmit Complete Interrupt Disable **/
#define SERCOM0_SPI_INTENCLR_TXC		(1 << 1)
/** SERCOM0_SPI_INTENCLR_DRE Data Register Empty Interrupt Disable **/
#define SERCOM0_SPI_INTENCLR_DRE		(1 << 0)

/**@}*/

/** @defgroup sercom0_usart_intenclr USARTINTENCLR USART Interrupt Enable Clear
@{*/

/** SERCOM0_USART_INTENCLR_ERROR Combined Error Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_ERROR		(1 << 7)
/** SERCOM0_USART_INTENCLR_RXBRK Break Received Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_RXBRK		(1 << 5)
/** SERCOM0_USART_INTENCLR_CTSIC Clear To Send Input Change Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_CTSIC		(1 << 4)
/** SERCOM0_USART_INTENCLR_RXS Receive Start Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_RXS		(1 << 3)
/** SERCOM0_USART_INTENCLR_RXC Receive Complete Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_RXC		(1 << 2)
/** SERCOM0_USART_INTENCLR_TXC Transmit Complete Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_TXC		(1 << 1)
/** SERCOM0_USART_INTENCLR_DRE Data Register Empty Interrupt Disable **/
#define SERCOM0_USART_INTENCLR_DRE		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cm_intenset I2CMINTENSET I2CM Interrupt Enable Set
@{*/

/** SERCOM0_I2CM_INTENSET_ERROR Combined Error Interrupt Enable **/
#define SERCOM0_I2CM_INTENSET_ERROR		(1 << 7)
/** SERCOM0_I2CM_INTENSET_SB Slave On Bus Interrupt Enable **/
#define SERCOM0_I2CM_INTENSET_SB		(1 << 1)
/** SERCOM0_I2CM_INTENSET_MB Master On Bus Interrupt Enable **/
#define SERCOM0_I2CM_INTENSET_MB		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cs_intenset I2CSINTENSET I2CS Interrupt Enable Set
@{*/

/** SERCOM0_I2CS_INTENSET_ERROR Combined Error Interrupt Enable **/
#define SERCOM0_I2CS_INTENSET_ERROR		(1 << 7)
/** SERCOM0_I2CS_INTENSET_DRDY Data Interrupt Enable **/
#define SERCOM0_I2CS_INTENSET_DRDY		(1 << 2)
/** SERCOM0_I2CS_INTENSET_AMATCH Address Match Interrupt Enable **/
#define SERCOM0_I2CS_INTENSET_AMATCH		(1 << 1)
/** SERCOM0_I2CS_INTENSET_PREC Stop Received Interrupt Enable **/
#define SERCOM0_I2CS_INTENSET_PREC		(1 << 0)

/**@}*/

/** @defgroup sercom0_spi_intenset SPIINTENSET SPI Interrupt Enable Set
@{*/

/** SERCOM0_SPI_INTENSET_ERROR Combined Error Interrupt Enable **/
#define SERCOM0_SPI_INTENSET_ERROR		(1 << 7)
/** SERCOM0_SPI_INTENSET_SSL Slave Select Low Interrupt Enable **/
#define SERCOM0_SPI_INTENSET_SSL		(1 << 3)
/** SERCOM0_SPI_INTENSET_RXC Receive Complete Interrupt Enable **/
#define SERCOM0_SPI_INTENSET_RXC		(1 << 2)
/** SERCOM0_SPI_INTENSET_TXC Transmit Complete Interrupt Enable **/
#define SERCOM0_SPI_INTENSET_TXC		(1 << 1)
/** SERCOM0_SPI_INTENSET_DRE Data Register Empty Interrupt Enable **/
#define SERCOM0_SPI_INTENSET_DRE		(1 << 0)

/**@}*/

/** @defgroup sercom0_usart_intenset USARTINTENSET USART Interrupt Enable Set
@{*/

/** SERCOM0_USART_INTENSET_ERROR Combined Error Interrupt Enable **/
#define SERCOM0_USART_INTENSET_ERROR		(1 << 7)
/** SERCOM0_USART_INTENSET_RXBRK Break Received Interrupt Enable **/
#define SERCOM0_USART_INTENSET_RXBRK		(1 << 5)
/** SERCOM0_USART_INTENSET_CTSIC Clear To Send Input Change Interrupt Enable **/
#define SERCOM0_USART_INTENSET_CTSIC		(1 << 4)
/** SERCOM0_USART_INTENSET_RXS Receive Start Interrupt Enable **/
#define SERCOM0_USART_INTENSET_RXS		(1 << 3)
/** SERCOM0_USART_INTENSET_RXC Receive Complete Interrupt Enable **/
#define SERCOM0_USART_INTENSET_RXC		(1 << 2)
/** SERCOM0_USART_INTENSET_TXC Transmit Complete Interrupt Enable **/
#define SERCOM0_USART_INTENSET_TXC		(1 << 1)
/** SERCOM0_USART_INTENSET_DRE Data Register Empty Interrupt Enable **/
#define SERCOM0_USART_INTENSET_DRE		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cm_intflag I2CMINTFLAG I2CM Interrupt Flag Status and Clear
@{*/

/** SERCOM0_I2CM_INTFLAG_ERROR Combined Error Interrupt **/
#define SERCOM0_I2CM_INTFLAG_ERROR		(1 << 7)
/** SERCOM0_I2CM_INTFLAG_SB Slave On Bus Interrupt **/
#define SERCOM0_I2CM_INTFLAG_SB		(1 << 1)
/** SERCOM0_I2CM_INTFLAG_MB Master On Bus Interrupt **/
#define SERCOM0_I2CM_INTFLAG_MB		(1 << 0)

/**@}*/

/** @defgroup sercom0_i2cs_intflag I2CSINTFLAG I2CS Interrupt Flag Status and Clear
@{*/

/** SERCOM0_I2CS_INTFLAG_ERROR Combined Error Interrupt **/
#define SERCOM0_I2CS_INTFLAG_ERROR		(1 << 7)
/** SERCOM0_I2CS_INTFLAG_DRDY Data Interrupt **/
#define SERCOM0_I2CS_INTFLAG_DRDY		(1 << 2)
/** SERCOM0_I2CS_INTFLAG_AMATCH Address Match Interrupt **/
#define SERCOM0_I2CS_INTFLAG_AMATCH		(1 << 1)
/** SERCOM0_I2CS_INTFLAG_PREC Stop Received Interrupt **/
#define SERCOM0_I2CS_INTFLAG_PREC		(1 << 0)

/**@}*/

/** @defgroup sercom0_spi_intflag SPIINTFLAG SPI Interrupt Flag Status and Clear
@{*/

